Adding new column name to data frame :-

In [19]:
# how to add a new column 
# eno,name,sal,comm,compname
# 100,rossum,34.56,10.00,psf

In [20]:
import numpy as np
import pandas as pd

In [21]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\student.csv")
print(df)

   sno   sname  marks
0  100  rossum  45.67
1  200  travis  56.87
2  300  hunter  66.10

In [22]:
# add a new column -total salary
# syntax for adding a new column name
# dataFrameObj[new column name]=value/expression

df["totsal"]=100

In [23]:
print(df)

   sno   sname  marks  totsal
0  100  rossum  45.67     100
1  200  travis  56.87     100
2  300  hunter  66.10     100

In [24]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\emp.csv")
print(df)

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [27]:
# adding a new column to a data frame :-
# print the total salary
df["totalSal"]=df["sal"]+df["comm"]
print(df)

   sno     name   sal  comm         com  totalSal
0  100   rossum  8000    80         psf      8080
1  200   travis  3500    35       numpy      3535
2  300   kinney  4000    65      pandas      4065
3  400  brendam  6000    50  javascript      6050
4  500    rohit  5000    80       react      5080
5  600   hunter  5500    90        next      5590

In [ ]:
# export or modify the emp.csv with modified data 
# to do this we use 
# dataFrameObj.to_csv("absolute_path")

In [28]:
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\Modifiedemp.csv")
print(df)

   sno     name   sal  comm         com  totalSal
0  100   rossum  8000    80         psf      8080
1  200   travis  3500    35       numpy      3535
2  300   kinney  4000    65      pandas      4065
3  400  brendam  6000    50  javascript      6050
4  500    rohit  5000    80       react      5080
5  600   hunter  5500    90        next      5590

In [29]:
# another example
d={"a":[10,20,30,40],"b":[1,2,3,4],"c":[1.1,2.2,3.3,4.4]}
print(d,type(d))

{'a': [10, 20, 30, 40], 'b': [1, 2, 3, 4], 'c': [1.1, 2.2, 3.3, 4.4]} <class 'dict'>

In [30]:
for key,val in d.items():
    print(key,"-->",val)

a --> [10, 20, 30, 40]
b --> [1, 2, 3, 4]
c --> [1.1, 2.2, 3.3, 4.4]

In [31]:
# convert dict object into dataframe
df=pd.DataFrame(d)
print(df)

    a  b    c
0  10  1  1.1
1  20  2  2.2
2  30  3  3.3
3  40  4  4.4

In [33]:
# add a new column and add the value of a,b,c in it
df["sum"]=df["a"]+df["b"]+df["c"]
print(df)

    a  b    c     d   sum
0  10  1  1.1  12.1  12.1
1  20  2  2.2  24.2  24.2
2  30  3  3.3  36.3  36.3
3  40  4  4.4  48.4  48.4

In [34]:
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\dictSum.csv")

In [35]:
# calculate the %
df["percentage"]=(df["sum"]/100)*100
print(df)

    a  b    c     d   sum  percentage
0  10  1  1.1  12.1  12.1        12.1
1  20  2  2.2  24.2  24.2        24.2
2  30  3  3.3  36.3  36.3        36.3
3  40  4  4.4  48.4  48.4        48.4

In [40]:
# create a student data table
studentData={"sno":[1,2,3,4],"name":["dhurvi","deepak","itty","rossum"],"eng":[98,95,95,99],"math":[100,96,96,98],"science":[99,92,94,93]}

# convert dict object into dataframe
df=pd.DataFrame(studentData)
print(df)
print("-"*50)
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\studentData.csv")
print("-"*50)
print(df)

   sno    name  eng  math  science
0    1  dhurvi   98   100       99
1    2  deepak   95    96       92
2    3    itty   95    96       94
3    4  rossum   99    98       93
--------------------------------------------------
--------------------------------------------------
   sno    name  eng  math  science
0    1  dhurvi   98   100       99
1    2  deepak   95    96       92
2    3    itty   95    96       94
3    4  rossum   99    98       93

In [45]:
# cal the total marks
df["total"]=df["eng"]+df["math"]+df["science"]
print(df)

   sno    name  eng  math  science  total
0    1  dhurvi   98   100       99    297
1    2  deepak   95    96       92    283
2    3    itty   95    96       94    285
3    4  rossum   99    98       93    290

In [53]:
# full marks subject wise
df["fullMarks"]=300
print(df)

   sno    name  eng  math  science  total  fullMarks  percentage
0    1  dhurvi   98   100       99    297        300       74.25
1    2  deepak   95    96       92    283        300       70.75
2    3    itty   95    96       94    285        300       71.25
3    4  rossum   99    98       93    290        300       72.50

In [56]:
# cal the %
df["percentage"]=round((df["total"]/df["fullMarks"])*100,2)
print(df)

   sno    name  eng  math  science  total  fullMarks  percentage
0    1  dhurvi   98   100       99    297        300       99.00
1    2  deepak   95    96       92    283        300       94.33
2    3    itty   95    96       94    285        300       95.00
3    4  rossum   99    98       93    290        300       96.67

In [ ]:
# give the grade acording to %
# filtering the data

In [57]:
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\ModifiedstudentData.csv")

In [58]:
print(df)

   sno    name  eng  math  science  total  fullMarks  percentage
0    1  dhurvi   98   100       99    297        300       99.00
1    2  deepak   95    96       92    283        300       94.33
2    3    itty   95    96       94    285        300       95.00
3    4  rossum   99    98       93    290        300       96.67

# Filtering the data in pandas

In [ ]:
# example on filtering the data

In [59]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\emp.csv")
print(df)

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [60]:
df["sal"]>5000

0     True
1    False
2    False
3     True
4    False
5     True
Name: sal, dtype: bool

In [ ]:
# it will give the boolean array

In [62]:
df[df["sal"]>5000]

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
3  400  brendam  6000    50  javascript
5  600   hunter  5500    90        next

In [ ]:
# get the names of those employee whose salary range between 5000 and 9000
(df["sal"]>=5000) & (df["sal"]<9000)

0     True
1    False
2    False
3     True
4     True
5     True
Name: sal, dtype: bool

In [65]:
# get the data
df[(df["sal"]>=5000) & (df["sal"]<9000)]

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [66]:
# print only name and sal
df[(df["sal"]>=5000) & (df["sal"]<9000)][["name","sal"]]

      name   sal
0   rossum  8000
3  brendam  6000
4    rohit  5000
5   hunter  5500

In [67]:
# get the emplyee name who only work in numpy
df["com"]=="numpy"

0    False
1     True
2    False
3    False
4    False
5    False
Name: com, dtype: bool

In [68]:
df[df["com"]=="numpy"][["name","sal"]]

     name   sal
1  travis  3500

In [69]:
#total sal paid to all the employee
df["sal"].sum()

np.int64(32000)

In [71]:
# find the emp who are working in numpy and react
(df["name"]=="react")| (df["name"]=="numpy")

0    False
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [76]:
df[(df["com"]=="react")| (df["com"]=="numpy")][["name","sal","com"]]

     name   sal    com
1  travis  3500  numpy
4   rohit  5000  react

In [78]:
for name in df[(df["com"]=="react")| (df["com"]=="numpy")]["name"]:
    print(name)

travis
rohit

In [79]:
# get he company name
df["com"]

0           psf
1         numpy
2        pandas
3    javascript
4         react
5          next
Name: com, dtype: object

In [80]:
for cname in df["com"]:
    print(cname)

psf
numpy
pandas
javascript
react
next

In [81]:
for cname in df["com"]:
    if cname in ["numpy","javascript"]:
        print(df)

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next
   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [82]:
# another method
x=dict(df[["name","com"]])
print(x)

{'name': 0     rossum
1     travis
2     kinney
3    brendam
4      rohit
5     hunter
Name: name, dtype: object, 'com': 0           psf
1         numpy
2        pandas
3    javascript
4         react
5          next
Name: com, dtype: object}

In [92]:
# get the data via loc
df.loc[(df["com"]=="numpy")| (df["com"]=="javascript")]["name"]

1     travis
3    brendam
Name: name, dtype: object